RQs/collection-code/wrk2-logs/w1_rate=400_2026-02-26 19_17_42_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 4.357ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.258ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.261ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.208ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.215ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.403ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.313ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.206ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.209ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.303ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.225ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.119ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.24ms    1.06ms   7.42ms   69.79%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.11ms
 75.000%    4.84ms
 90.000%    5.59ms
 99.000%    7.42ms
 99.900%    9.11ms
 99.990%   10.71ms
 99.999%   10.71ms
100.000%   10.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.127     0.000000            2         1.00
       2.979     0.100000          105         1.11
       3.371     0.200000          210         1.25
       3.629     0.300000          314         1.43
       3.861     0.400000          419         1.67
       4.115     0.500000          523         2.00
       4.247     0.550000          576         2.22
       4.379     0.600000          633         2.50
       4.515     0.650000          681         2.86
       4.671     0.700000          733         3.33
       4.839     0.750000          787         4.00
       4.911     0.775000          811         4.44
       5.031     0.800000          837         5.00
       5.135     0.825000          863         5.71
       5.299     0.850000          890         6.67
       5.483     0.875000          916         8.00
       5.535     0.887500          929         8.89
       5.599     0.900000          943        10.00
       5.707     0.912500          955        11.43
       5.799     0.925000          968        13.33
       5.899     0.937500          981        16.00
       5.963     0.943750          988        17.78
       6.055     0.950000          994        20.00
       6.135     0.956250         1001        22.86
       6.239     0.962500         1007        26.67
       6.463     0.968750         1014        32.00
       6.547     0.971875         1017        35.56
       6.703     0.975000         1020        40.00
       6.787     0.978125         1024        45.71
       6.927     0.981250         1027        53.33
       6.975     0.984375         1030        64.00
       7.019     0.985938         1032        71.11
       7.235     0.987500         1033        80.00
       7.347     0.989062         1035        91.43
       7.535     0.990625         1037       106.67
       7.587     0.992188         1038       128.00
       7.647     0.992969         1039       142.22
       7.807     0.993750         1040       160.00
       8.083     0.994531         1041       182.86
       8.279     0.995313         1042       213.33
       8.279     0.996094         1042       256.00
       8.535     0.996484         1043       284.44
       8.535     0.996875         1043       320.00
       8.759     0.997266         1044       365.71
       8.759     0.997656         1044       426.67
       8.759     0.998047         1044       512.00
       9.111     0.998242         1045       568.89
       9.111     0.998437         1045       640.00
       9.111     0.998633         1045       731.43
       9.111     0.998828         1045       853.33
       9.111     0.999023         1045      1024.00
      10.711     0.999121         1046      1137.78
      10.711     1.000000         1046          inf
#[Mean    =        4.236, StdDeviation   =        1.062]
#[Max     =       10.704, Total count    =         1046]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  4005 requests in 10.00s, 840.89KB read
Requests/sec:    400.39  
Transfer/sec:     84.07KB